# IsDrawnInForeground Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
SymbolicCurve..::..IsDrawnInForeground Property
SymbolicCurve Class See Also
---
Indicates if this curve will be drawn in the foreground of the family instance.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public bool IsDrawnInForeground { get; set; }
```

Visual Basic
---
```text
Public Property IsDrawnInForeground As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool IsDrawnInForeground {
	bool get ();
	void set (bool value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | Thrown when regeneration failed. Thrown when the value for this property cannot be changed. |

# See Also
SymbolicCurve Class
Autodesk.Revit.DB Namespace